app/views/event/index.html.erb

<div class="d-flex flex-wrap justify-content-center">
<%Event.all.each do |event|%>
---
SELECT "events".* FROM "events"

    <div class="card-body">
      <h5 class="card-title">Event numéro <%= Event.all.index(event) + 1 %></h5>
---
SELECT "events".* FROM "events"