app/controllers/attendance_controller.rb

  def index
    @attendances = Attendance.where(event_id: params[:event_id])
    @event = Event.find(params[:event_id])
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 2]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def new
    @user = current_user
    @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create

    @user = current_user
    @event = Event.find(params[:event_id])
    @amount = (@event.price)

      customer = Stripe::Customer.create({
      email: params[:stripeEmail],
      source: params[:stripeToken],
      })

      charge = Stripe::Charge.create({
      customer: customer.id,
      amount: @amount,
      description: "Achat d'un produit",
      currency: 'eur',
      })

      @attendance = Attendance.create(guest: @user, event: @event, stripe_customer_id: customer.id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
INSERT INTO "attendances" ("stripe_customer_id", "guest_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stripe_customer_id", "cus_KZn059mPa4qU5V"], ["guest_id", 26], ["event_id", 15], ["created_at", "2021-11-11 13:34:27.006404"], ["updated_at", "2021-11-11 13:34:27.006404"]]

  def is_host?
    @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def is_already_a_guest?
    @event = Event.find(params[:event_id])
    if @event.guests.include? current_user
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def is_admin?
    @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]