app/controllers/event_pic_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
---
  def create
    @event = Event.find(params[:event_id])