app/controllers/event_controller.rb

  def create
    @event = Event.new(start_date: params[:event_start_date], duration: params[:event_duration],
                       title: params[:event_title], host: current_user, description: params[:event_description], price: params[:event_price], location: params[:event_location], event_pic: params[:event_pic])
    if @event.save
---
INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "created_at", "updated_at", "host_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @event = Event.find(params[:id])
    if @event.update(start_date: params[:event_start_date], duration: params[:event_duration],
      title: params[:event_title], host: current_user, description: params[:event_description], price: params[:event_price], location: params[:event_location], event_pic: params[:event_pic])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
UPDATE "events" SET "start_date" = $1, "title" = $2, "host_id" = $3, "updated_at" = $4 WHERE "events"."id" = $5  [["start_date", "2021-11-19 00:00:00"], ["title", "test edition"], ["host_id", 24], ["updated_at", "2021-11-11 08:51:10.038043"], ["id", 5]]